Revit 2026 API

# ImageTypeOptionsIsValid Method

---

If true the ImageTypeOptions can be used to create or reload an ImageType.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsValid(
	Document document
)
```
```vb
Public Function IsValid (
	document As Document
) As Boolean
```
```cpp
public:
bool IsValid(
	Document^ document
)
```
```fsharp
member IsValid :
        document : Document -> bool
```

#### Parameters

document Document
     The document.

#### Return Value

Boolean Returns True if the options can be used to create or reload an ImageType. False otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

This method returns true if all the following checks are true:

  * The Path points to a file that is a supported image file type.
  * The Path points to a file that is not encrypted, which can happen for PDF files.
  * The Path points to a file that contains the specified PageNumber.
  * Only imported images are allowed in family documents.

#### Reference

ImageTypeOptions Class

Autodesk.Revit.DB Namespace